       IDENTIFICATION DIVISION.
       PROGRAM-ID. TP02.
       AUTHOR. BRENNO BARBOSA E DIEGO NATALO.
       DATE-WRITTEN. 26/09/2021.
       DATE-COMPILED. 26/09/2021.
       SECURITY. TP02.
      *---------------------------------------------------------
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. RYZEN GEN2.
       OBJECT-COMPUTER. RYZEN GEN2.
       SPECIAL-NAMES.
       DECIMAL-POINT IS COMMA.
      *---------------------------------------------------------
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FICHA.
       05 NOMECOMPLETO.
       10 NOME PIC A(20).
       10 SOBRENOME PIC A(30).
       05 PRONTUARIO PIC X(8).
       05 SALARIO.
       10 BRUTO PIC 9(5)V99.
       10 LIQUIDO PIC 9(5)V99.
       10 REFERENCIA PIC 9(5)V99.
       10 INSS PIC 9(5)V99.
       10 IRRF PIC 9(5)V99.
       77 WKHORAS PIC 999.
       77 WKVALHORA PIC 999.
       77 WKQTDDEPEND PIC Z9.
       77 WKDESCDEPEND PIC 9(5)V99.
       77 WKTEMP PIC 9(5)V99.
       77 VALHORA-SC PIC ZZZ,ZZ VALUES ZERO.
       77 BRUTO-SC PIC ZZZZZ,ZZ VALUES ZERO.
       77 LIQUIDO-SC PIC ZZZZZ,ZZ VALUES ZERO.
       77 INSS-SC PIC ZZZZZ,ZZ VALUES ZERO.
       77 IRRF-SC PIC ZZZZZ,ZZ VALUES ZERO.
      *---------------------------------------------------------
       PROCEDURE DIVISION.
       INICIO.
      *TELA
       DISPLAY "TP 02 - BRENNO E DIEGO" AT 0120.
       DISPLAY "Nome:" AT 0305 WITH BACKGROUND-COLOR 5.
       DISPLAY "Sobrenome:" AT 0405 WITH BACKGROUND-COLOR 3.
       DISPLAY "Prontuario:" AT 0505 WITH BACKGROUND-COLOR 2.
       DISPLAY "Valor da hora:" AT 0605 WITH BACKGROUND-COLOR 6.
       DISPLAY "Quantidade de horas:" AT 0705 WITH BACKGROUND-COLOR 1.
       DISPLAY "Quant. de dependentes:" AT 0805 WITH BACKGROUND-COLOR 3.
      *ENTRADAS
       ACCEPT NOME AT 0310 WITH BACKGROUND-COLOR 5.
       ACCEPT SOBRENOME AT 0415 WITH BACKGROUND-COLOR 3.
       ACCEPT PRONTUARIO AT 0516 WITH BACKGROUND-COLOR 2.
       ACCEPT WKVALHORA AT 0619 WITH BACKGROUND-COLOR 6.
       ACCEPT WKHORAS AT 0725 WITH BACKGROUND-COLOR 1.
       ACCEPT WKQTDDEPEND AT 0827 WITH FOREGROUND-COLOR 3.
      *CALCULOS
       COMPUTE BRUTO = WKHORAS * WKVALHORA.
       COMPUTE INSS = 0,14 * BRUTO.
       COMPUTE REFERENCIA = BRUTO - INSS.
       COMPUTE WKTEMP = 0,275 * REFERENCIA.
       COMPUTE WKTEMP = WKTEMP - 869,36.
       COMPUTE IRRF = WKTEMP + WKDESCDEPEND.
       COMPUTE LIQUIDO = REFERENCIA - IRRF.

       MOVE WKVALHORA TO VALHORA-SC.
       MOVE BRUTO TO BRUTO-SC.
       MOVE INSS TO INSS-SC.
       MOVE IRRF TO IRRF-SC.
       MOVE LIQUIDO TO LIQUIDO-SC.

      *APRESENTA��O DOS RESULTADOS
       DISPLAY "SALARIO BRUTO: R$" AT 1005 BRUTO-SC
       WITH BACKGROUND-COLOR 3.
       DISPLAY "INSS: R$" AT 1105 INSS-SC WITH BACKGROUND-COLOR 3.
       DISPLAY "IRRF: R$" AT 1205 IRRF-SC WITH BACKGROUND-COLOR 3.
       DISPLAY "SALARIO LIQUIDO: R$" AT 1305 LIQUIDO-SC
       WITH BACKGROUND-COLOR 3.
       DISPLAY "---------FICHA---------" AT 1505
       WITH BACKGROUND-COLOR 6.

       DISPLAY "NOME:" AT 1705 WITH BACKGROUND-COLOR 5
       NOME WITH BACKGROUND-COLOR 5.

       DISPLAY "SOBRENOME:" AT 1805 WITH BACKGROUND-COLOR 3
       SOBRENOME WITH BACKGROUND-COLOR 3.

       DISPLAY "PRONTUARIO:" AT 1905 WITH BACKGROUND-COLOR 3
       PRONTUARIO WITH BACKGROUND-COLOR 1.

       DISPLAY "VALOR DA HORA TRABALHADA: R$" AT 2005
       WITH BACKGROUND-COLOR 3

       VALHORA-SC WITH BACKGROUND-COLOR 3.
       DISPLAY "QTD DE HORAS:" AT 2105 WITH BACKGROUND-COLOR 3
       WKHORAS WITH BACKGROUND-COLOR 3.

       DISPLAY "QTD DE DEPENDENTES:" AT 2205 WITH BACKGROUND-COLOR 3
       WKQTDDEPEND WITH BACKGROUND-COLOR 3.

      *POSICIONAR CURSOR NO FIM DA TELA*
       DISPLAY " " AT 2405.
       STOP "Pressione qualquer tecla para terminar...".
       STOP RUN.
